let time=prompt ('Сколько часов в день ты проводишь в соцсетях?')
if (time<=0) {
    alert ('Ты наверное кот');
} else if (time<=2){
    alert('Ты не зависим от соцсетей');
} else if (time<=6){
    alert('Тебе нужно сокращать время в соцсетях');
}else if (time>=7){
    alert('Если ты не зарабатываешь на этом, тебе нужно что-то менять в этой жизни');
}


let age = +prompt("Возраст",0);

if (age>=18) {
    let sex=prompt("Пол м/ж");

    // let text =`Вы ${sex=="м" ? "Мужчина": "Женщина"}`; 

    if (sex=="м") {
        alert("дари носки")
    } else if (sex=="ж"){
        alert ("Дари цветы")
    } else {
        alert ("Что ты такое?");
    }
} else {
    alert ("Дари мороженое");
}

